# PathReinSpanlengthBarlengthAlt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinSpanlengthBarlengthAlt Property
ParameterTypeId Class See Also
---
"Length (Alternating Bar)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinSpanlengthBarlengthAlt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinSpanlengthBarlengthAlt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinSpanlengthBarlengthAlt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace